[
  {
    "id": "1",
    "name": "Trivia Game",
    "img": "/img/trivia.png",
    "imgAlt": "Page d'accueil du jeu trivia",
    "stack": ["HTML", "Tailwind", "JavaScript"],
    "description": "Ce projet, réalisé dans le cadre du cours d'application interactive, consiste à créer un jeu de questions réponses avec une base de données externe. Entrièrement créé en langages de programmation vanilles, il utilise le local storage afin de stocker les meilleurs scores, les préférences de l'utilisateur et le jeu en cours. Pour ce projet, en équipe de deux, nous avons réalisé des maquettes sur Figma que nous avons reproduit à l'identique, tout en assurant un bel affichage pour tous les écrans. Pour ce qui est de la programmation, nous avons choisi une approche orientée objet afin que chaque fonctionnalité soit maintenable facilement.",
    "date": "Octobre 2024",
    "categories": ["Programmation", "Design"],
    "liens": {
      "github": "https://github.com/ClemeDigs/trivia.git",
      "vercel": "https://trivia-henna-mu.vercel.app/",
      "figma": "https://www.figma.com/design/iroepunx3oV9IkoxxJdWbQ/TL1---TRIVIA?node-id=0-1&t=15AXn97QpQhtr6Du-1"
    }
  },
  {
    "id": "2",
    "name": "Maison de la Culture du Pic Champlain",
    "img": "/img/mcpc-design.png",
    "imgAlt": "Haut de la page notre organisme",
    "stack": ["Figma", "Adobe Illustrator"],
    "description": "La Maison de la Culture du Pic Champlain est un organisme à but non lucratif situé à côté de Rimouski. Pour ce projet, nous avons eu la chance de travailler des clients réels, une équipe passionée et très ouverte d'esprit. Nous avons, en équipe de 4, effectué une profonde recherche pour la refonte de leur site web sur les utilisateurs, les compétiteurs et l'architecture afin de leur proposer des maquettes et de nouvelles fonctonnalités qui seraient, peur eux comme pour les utilisateurs, utiles et pertinantes. Ce projet sera développé sur WordPress avec PHP en janvier 2025.",
    "date": "Juillet 2024",
    "categories": ["Design"],
    "liens": {
      "figma": "https://www.figma.com/design/QfkPJ5HytDJHcPMwLEWSZH/MCPC_Projet-I_Design?node-id=1648-12850&t=f1Ag0t5pfL7PrKwz-1"
    }
  },
  {
    "id": "3",
    "name": "Le Botaniste (en cours)",
    "img": "/img/botaniste.png",
    "imgAlt": "Page d'accueil du Botaniste",
    "stack": ["HTML", "Tailwind", "React", "Shopify"],
    "description": "Le Botaniste est un site web de vente de plantes en ligne. Réalisé avec Shopify et React, nous travaillons afin d'implémenter des composants interactifs et réactifs. Nous utilisons Shopify pour entrer des données qui sont récupérées avec des requêtes GraphQL, ainsi que des cookies pour garder en mémoire les préférences de l'utilisateur. Toujours en cours de développement, ce site web est une belle opportunité pour explorer des contextes réels de travail dans une compagnie de développement.",
    "date": "Novembre 2024",
    "categories": ["Programmation"],
    "liens": {
      "github": "https://github.com/ClemeDigs/le_botaniste.git"
    }
  },
  {
    "id": "4",
    "name": "Recherche sur Angular (en cours)",
    "img": "/img/pokemon.png",
    "imgAlt": "Page d'accueil de Un Zeste de Clémentine",
    "stack": ["HTML", "CSS", "Angular", "TypeScript", "RevealJS"],
    "description": "Dans le cadre de ma formation en production en médias interactifs, j'ai choisi Angular comme sujet de recherche et développement. Toujours en cours de développement, ce projet consiste à explorer tous les aspects d'Angular et de les présenter à mes camarades. Pour ce projet, j'ai créé deux présentations et divers projets. Mon but est de pouvoir, dans un contexte professionnel, me repérer facilement dans un projet Angular avec ses mots-clés et son fonctionnement propre et bien sur, le permettre à mes camarades en leur synthétisant l'information le mieux possible.",
    "date": "Novembre 2024",
    "categories": ["Programmation"],
    "liens": {
      "github": "https://github.com/ClemeDigs/angular.git",
      "vercel": "https://angular-iota-lilac.vercel.app/",
      "télécharger": "/docs/angular-18_p1.pdf"
    }
  },
  {
    "id": "5",
    "name": "Un Zeste de Clémentine",
    "img": "/img/un-zeste.png",
    "imgAlt": "Page d'accueil de Un Zeste de Clémentine",
    "stack": ["HTML", "Tailwind", "JavaScript"],
    "description": "Un Zeste de Clémentine est un site web de type commerce en programmation vanille. La vente en ligne n'est pas fonctionnelle, mais il se présente comme tel. Ce projet m'a permis de comprendre en détail le fonctionnement d'un panier, la programmation orientée objet et l'avantage des classes. Parmis les fonctionnalités de ce site web, il y a également la validation de formulaire et la génération de produits par composants JavaScript. ",
    "date": "Juin 2024",
    "categories": ["Programmation", "Design"],
    "liens": {
      "github": "https://github.com/ClemeDigs/tl-02_interface-mobile_clementine.git",
      "vercel": "https://tl-02-interface-mobile-v4.vercel.app/"
    }
  },
  {
    "id": "6",
    "name": "La Ruche",
    "img": "/img/la-ruche.png",
    "imgAlt": "Mockup de La Ruche",
    "stack": ["Figma", "Adobe Illustrator"],
    "description": "La Ruche est une maquette haute fidélité d'un projet créé dans le cours de design UX / UI. Le mandat était de créer un concept et d'effectuer de la recherche afin d'arriver à un prototype. J'ai choisi de designer une application mobile pour des échanges de services. Pour ma recherche, j'ai effectué des sondages, fait des recherches surles utilisateurs potentiels, les compétiteurs, shématisé un parcours utilisateur et établi une planche d'ambiance avant de commencer à designer. Par la suite, j'ai créé des maquettes filaires, haute fidélité puis un prototype final, le tout accompagné d'un UI kit.",
    "date": "Mai 2024",
    "categories": ["Design"],
    "liens": {
      "figma": "https://www.figma.com/proto/m67k5H1VJST5X5zTyHnCzc/UI-Kit?page-id=105%3A1849&node-id=170-4765&viewport=300%2C-652%2C0.17&t=Q4qBzwFfLy6BzsaH-1&scaling=scale-down&starting-point-node-id=170%3A4765&classId=52aee0ef-409a-4d8a-a7fc-2b90b0636a3d&assignmentId=c197be93-1dcb-46c4-ad53-bff9c08867a1&submissionId=bde25ec6-03c2-704f-2825-055fe319821e"
    }
  },
  {
    "id": "7",
    "name": "Divers projets UI",
    "img": "/img/design-challenge.png",
    "imgAlt": "Design d'une page produit",
    "stack": ["Figma"],
    "description": "Ces divers petits projets, présentés comme des challenges, étaient réalisés en quelques heures seulement dans le cadre du cours de design UX / UI. Pour chaque projet, j'ai effectué une phase de recherche, une maquette filaire, un user flow avant d'en arriver à la maquette finale. Parfois, j'ai utilisé des banques de composants. Chaque challenge portait sur un thème différent. Parmis ceux-ci, l'interface utilisateur, le formulaire, la page produit d'une boutique en ligne, une landing page, et un billet d'avion.",
    "date": "Mai 2024",
    "categories": ["Design"],
    "liens": {
      "figma": "https://www.figma.com/design/MNcl76WxCnkE1PFmhAVFmb/Design-Challenge---Cl%C3%A9mentine?node-id=0-1&t=mBXoIvAPB7hUoJXM-1"
    }
  },
  {
    "id": "8",
    "name": "Motion Design",
    "img": "/img/motion-design.png",
    "imgAlt": "Mosaique d'une image extraite de l'animation",
    "stack": ["Adobe After Effects", "Adobe Animate"],
    "description": "Projet dans le cadre du cours de production d'animation. Production d'une courte vidéo de Motion Design. Dessin, animation, esthétique.",
    "date": "Avril 2024",
    "categories": ["Design"],
    "liens": {
      "youtube": "https://youtu.be/NhTsudZq918"
    }
  },
  {
    "id": "9",
    "name": "Rapport de recommandations",
    "img": "/img/cafe-smith.png",
    "imgAlt": "Image de présentation du rapport",
    "stack": ["Figma"],
    "description": "Projet dans le cadre du cours d'ergonomie de l'interface. Tâches réalisées: Audit ergonomique et rapport de recommandations. Travail d'équipe sur le site web du café Smith, afin de repérer les points à améliorer et proposer des recommandations.",
    "date": "Mars 2024",
    "categories": ["Design"],
    "liens": {
      "figma": "https://www.figma.com/design/HR4FMSZ5Ys4pRzluCWs1Q6/Rapport-de-recommandations?node-id=0-1&t=XJjF06yBTPOWHypM-1",
      "télécharger": "/docs/recommandations.pdf"
    }
  },
  {
    "id": "10",
    "name": "Jeux divers",
    "img": "/img/jeux.png",
    "imgAlt": "Interfaces des jeux",
    "stack": ["HTML", "CSS", "JavaScript"],
    "description": "Petits projets divers, personnels ou dans le cadre des cours en javascript vanille. Jeu des couleurs, pierre feuille ciseaux, morpion et jeu de mémoire.",
    "date": "Janvier 2024",
    "categories": ["Programmation"],
    "liens": {
      "vercel": "https://jeux-one.vercel.app/"
    }
  },
  {
    "id": "11",
    "name": "Palette aléatoire",
    "img": "/img/palette.png",
    "imgAlt": "Interface de la palette aléatoire",
    "stack": ["HTML", "CSS", "JavaScript"],
    "description": "Projet personnel pour s'exercer en JavaScript. Création d'une palette aléatoire avec verouillage de couleurs.",
    "date": "Avril 2024",
    "categories": ["Programmation"],
    "liens": {
      "github": "https://github.com/ClemeDigs/palette.git",
      "vercel": "https://palette.vercel.app/"
    }
  },
  {
    "id": "12",
    "name": "Incubateur A2",
    "img": "/img/a2.png",
    "imgAlt": "Page projets de A2",
    "stack": ["Figma", "Adobe Illustrator"],
    "description": "Projet dans le cadre du premier cours de Design Web. Le thème est un incubateur. Recherche sur le marché, les utilisateurs et les compétiteurs. Recherche de références. Design de deux pages, création des illustrations et des animations.",
    "date": "Décembre 2023",
    "categories": ["Design"],
    "liens": {
      "figma": "https://www.figma.com/design/v9XCB5gp2OReOfhRMsE9eI/A2?node-id=1-1154&t=U84hwU2J22RiCKQ1-1"
    }
  }
]
